% x=[49 100 144 225];
% 
% y1=[93.11 98.00 98.31 98.56];
% y2=[95.78 98.97 98.67 99.50];
% 
% 
% plot(x,y1,'*-r');
% hold on;
% plot(x,y2,'o-b');
% axis([0 330,90 100]);
% title("节点数量与可达率关系");
% xlabel("节点数量");
% ylabel("可达率");
% legend('管理泛洪','泛洪约束')


% x=[49 100 144 225];
% 
% y1=[7.37 6.12 3.80 3.38];
% y2=[7.46 5.99 5.58 4.35];
% 
% 
% plot(x,y1,'*-r');
% hold on;
% plot(x,y2,'o-b');
% axis([0 250,0 10]);
% title("平均每跳网络延迟与节点数量关系");
% xlabel("节点数量");
% ylabel("每跳网络延迟(ms)");
% legend('管理泛洪','泛洪约束')


x=[49 100 144 225];

y1=[93.11 98.00 98.31 98.56];
y2=[92.75 61.67 23.55 21.35];


plot(x,y1,'*-r');
hold on;
plot(x,y2,'o-b');
axis([0 320,0 100]);
title("参与转发节点占总结点比例与节点数量关系");
xlabel("节点数量");
ylabel("参与转发节点比例");
legend('管理泛洪','泛洪约束')


